OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/3_place.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/3_place.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0051] Sink buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    sky130_fd_sc_hd__clkbuf_16
[INFO CTS-0049] Characterization buffer is sky130_fd_sc_hd__clkbuf_16.
[WARNING CTS-0083] No clock nets have been found.
[INFO CTS-0008] TritonCTS found 0 clock nets.
[WARNING CTS-0082] No valid clock nets in the design.
estimate_parasitics -placement
detailed_placement
[INFO DPL-0006] Core area: 12465.71 um^2, Instances area: 5021.07 um^2, Utilization: 40.3%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                     526
Diamond Move Success:            526 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL            8431.9 u
legalized HPWL           8651.8 u
delta HPWL                    3 %

estimate_parasitics -placement
repair_timing -setup_margin 0.0 -hold_margin 0.0 -repair_tns 100 -match_cell_footprint -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
detailed_placement
[INFO DPL-0006] Core area: 12465.71 um^2, Instances area: 5021.07 um^2, Utilization: 40.3%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                     526
Diamond Move Success:            526 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL            8651.8 u
legalized HPWL           8651.8 u
delta HPWL                    0 %

Report metrics stage 4, cts final...
No registers in design

==========================================================================
cts final report_design_area
--------------------------------------------------------------------------
Design area 5021 um^2 40% utilization.
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/4_1_cts.odb
write_sdc -no_timestamp /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/4_cts.sdc
Elapsed time: 0:00.96[h:]min:sec. CPU time: user 0.89 sys 0.09 (101%). Peak memory: 149064KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
4_1_cts                            0            145 43a223557ea69a3f8270
