###############################################################################
# Created by write_sdc
###############################################################################
current_design seq_detector_0011
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 0.8660 [get_ports {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {detected}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
