OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/5_route.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/5_route.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
exec cp /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/5_route.odb /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/6_1_fill.odb
Elapsed time: 0:00.32[h:]min:sec. CPU time: user 0.28 sys 0.04 (99%). Peak memory: 117500KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
6_1_fill                           0            114 dfb15e8367de1ee03b78
