###############################################################################
# Created by write_sdc
###############################################################################
current_design fir_filter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 8.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[100]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[101]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[102]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[103]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[104]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[105]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[106]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[107]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[108]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[109]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[110]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[111]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[112]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[113]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[114]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[115]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[116]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[117]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[118]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[119]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[120]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[121]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[122]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[123]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[124]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[125]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[126]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[127]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[64]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[65]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[66]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[67]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[68]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[69]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[70]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[71]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[72]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[73]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[74]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[75]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[76]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[77]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[78]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[79]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[80]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[81]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[82]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[83]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[84]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[85]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[86]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[87]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[88]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[89]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[90]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[91]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[92]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[93]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[94]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[95]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[96]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[97]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[98]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[99]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in[9]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[16]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[17]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[18]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[19]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[20]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[21]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[22]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[23]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[24]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[25]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[26]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[27]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[28]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[29]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[30]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[31]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[32]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[33]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[34]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[35]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
