read_verilog ../design_candidate.v
synth -top seq_detect_101
write_verilog design_syn.v
