read_verilog ../design_candidate.v
synth -top fir_filter
write_verilog design_syn.v
