read_verilog ../design_candidate.v
synth -top rising_edge_detector
write_verilog design_syn.v
