OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/3_3_place_gp.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/2_floorplan.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
estimate_parasitics -placement
Perform buffer insertion and gate resizing...
repair_design -verbose -match_cell_footprint
Iteration |   Area    | Resized | Buffers | Nets repaired | Remaining
---------------------------------------------------------------------
        0 |     +0.0% |       0 |       0 |             0 |        26
       10 |     +0.0% |       0 |       0 |             0 |        16
       20 |     +0.0% |       0 |       0 |             0 |         6
    final |     +0.0% |       0 |       0 |             0 |         0
---------------------------------------------------------------------
Floating nets: 
Report metrics stage 3, resizer...

==========================================================================
resizer report_design_area
--------------------------------------------------------------------------
Design area 226 um^2 15% utilization.
Instance count before 37, after 37
Pin count before 65, after 65
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p4/results/sky130hd/button_debouncer/base/3_4_place_resized.odb
Elapsed time: 0:00.39[h:]min:sec. CPU time: user 0.31 sys 0.09 (99%). Peak memory: 138776KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_4_place_resized                  0            135 c7cb65dd1cba21d95d9d
