OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p7/results/sky130hd/exp_fixed_point/base/2_2_floorplan_macro.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p7/results/sky130hd/exp_fixed_point/base/2_1_floorplan.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 324 tapcells.
Design area 4527 um^2 19% utilization.
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p7/results/sky130hd/exp_fixed_point/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.33[h:]min:sec. CPU time: user 0.28 sys 0.04 (98%). Peak memory: 119192KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            116 cbdff8f213ad10044c64
