read_verilog ../design_candidate.v
synth -top fp16_multiplier
write_verilog design_syn.v
