read_verilog ../design_candidate.v
synth -top dot_product
write_verilog design_syn.v
