read_verilog ../design_candidate.v
synth -top shift_register_4bit
write_verilog design_syn.v
