OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/seq_detector_0011/base/2_2_floorplan_macro.odb
read_sdc ./results/sky130hd/seq_detector_0011/base/2_1_floorplan.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO TAP-0005] Inserted 435 tapcells.
Design area 689 um^2 2% utilization.
write_db ./results/sky130hd/seq_detector_0011/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.34[h:]min:sec. CPU time: user 0.29 sys 0.04 (97%). Peak memory: 117632KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            114 057793519ac565048af9
