OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/seq_detector_0011/base/5_route.odb
read_sdc ./results/sky130hd/seq_detector_0011/base/5_route.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
exec cp ./results/sky130hd/seq_detector_0011/base/5_route.odb ./results/sky130hd/seq_detector_0011/base/6_1_fill.odb
Elapsed time: 0:00.35[h:]min:sec. CPU time: user 0.31 sys 0.04 (99%). Peak memory: 120544KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
6_1_fill                           0            117 ea5a999729ad84427e18
