OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/2_1_floorplan.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/2_1_floorplan.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 4423 um^2 35% utilization.
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p8/results/sky130hd/fp16_multiplier/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.32[h:]min:sec. CPU time: user 0.29 sys 0.03 (99%). Peak memory: 118288KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            115 f8429b91de2e3e847d1c
