OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p3/results/sky130hd/seq_detect_101/base/3_place.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p3/results/sky130hd/seq_detect_101/base/3_place.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is sky130_fd_sc_hd__clkbuf_4.
[INFO CTS-0051] Sink buffer is sky130_fd_sc_hd__clkbuf_8.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    sky130_fd_sc_hd__clkbuf_4
                    sky130_fd_sc_hd__clkbuf_8
[INFO CTS-0049] Characterization buffer is sky130_fd_sc_hd__clkbuf_8.
[WARNING CTS-0083] No clock nets have been found.
[INFO CTS-0008] TritonCTS found 0 clock nets.
[WARNING CTS-0082] No valid clock nets in the design.
estimate_parasitics -placement
detailed_placement
[INFO DPL-0006] Core area: 1559.00 um^2, Instances area: 146.39 um^2, Utilization: 9.4%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                      10
Diamond Move Success:             10 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL             159.0 u
legalized HPWL            159.7 u
delta HPWL                    0 %

estimate_parasitics -placement
repair_timing -setup_margin 0.1 -hold_margin 0.1 -repair_tns 100 -match_cell_footprint -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
detailed_placement
[INFO DPL-0006] Core area: 1559.00 um^2, Instances area: 146.39 um^2, Utilization: 9.4%
[INFO DPL-0005] Diamond search max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
[INFO DPL-1101] Legalizing using diamond search.
Movements Summary
---------------------------------------
Total cells:                      10
Diamond Move Success:             10 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL             159.7 u
legalized HPWL            159.7 u
delta HPWL                    0 %

Report metrics stage 4, cts final...

==========================================================================
cts final report_design_area
--------------------------------------------------------------------------
Design area 146 um^2 9% utilization.
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p3/results/sky130hd/seq_detect_101/base/4_1_cts.odb
write_sdc -no_timestamp /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p3/results/sky130hd/seq_detect_101/base/4_cts.sdc
Elapsed time: 0:01.73[h:]min:sec. CPU time: user 1.65 sys 0.07 (99%). Peak memory: 154392KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
4_1_cts                            1            150 c82334480b756ece2071
