OpenROAD 26Q2-339-g0504146ce6 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 4 thread(s).
read_liberty /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p10/results/sky130hd/rising_edge_detector/base/2_3_floorplan_tapcell.odb
read_sdc /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p10/results/sky130hd/rising_edge_detector/base/2_1_floorplan.sdc
source /home/harish_d1121/OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 75 um^2 7% utilization.
write_db /home/harish_d1121/Spec_to_Tapeout-main/openroad_runs/p10/results/sky130hd/rising_edge_detector/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.33[h:]min:sec. CPU time: user 0.30 sys 0.04 (99%). Peak memory: 119932KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            117 3b93246af837f5ee331d
